<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"management","backend":"383dd645f75f049be082f4b249c3111c18c669ca82a5fc6e26d030ed66997259","plan_job_ref":"Job Tests for PRs #94 at https://github.com/GSA-TTS/FAC/actions/runs/4816408656","plan_hash":"01e57f8e4a7acf7cb97bf88b0dba4447ec2b7565b3bc79b2cbbab4000af06adc","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __management__
<details>
<summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_space.space["dev-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "dev-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space.space["production-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "production-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space.space["staging-egress"] will be created
  + resource "cloudfoundry_space" "space" {
      + allow_ssh  = true
      + asgs       = [
          + "c515ab7a-c05a-40c7-b2fe-146a457336a8",
          + "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "staging-egress"
      + org        = "d030fa77-d07d-4164-8f15-25dbc1c04f44"
    }

  # cloudfoundry_space_users.space_permissions["dev-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["production-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

  # cloudfoundry_space_users.space_permissions["staging-egress"] will be created
  + resource "cloudfoundry_space_users" "space_permissions" {
      + auditors   = (known after apply)
      + developers = [
          + "alexander.steel@gsa.gov",
          + "bret.mogilefsky@gsa.gov",
          + "daniel.swick@gsa.gov",
          + "edward.zapata@gsa.gov",
          + "hassandeme.mamasambo@gsa.gov",
          + "james.person@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "lindsayn.young@gsa.gov",
          + "matt.henry@gsa.gov",
          + "matthew.jadud@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
          + "timothy.ballard@gsa.gov",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "540d4f62-7b33-4fb4-a25c-1a112754c004",
          + "bret.mogilefsky@gsa.gov",
          + "jeanmarie.mariadassou@gsa.gov",
          + "tadhg.ohiggins@gsa.gov",
        ]
      + space      = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #94](https://github.com/GSA-TTS/FAC/actions/runs/4816408656)